{
  "suggestions": {
    "baseline": [
      {
        "max": 2.5,
        "text": "底线相持稳定性较弱，容易在几拍之内出现连续失误，建议优先提高基本连续对拉能力，比如在练习中先把稳定 6～8 拍作为阶段性目标。"
      },
      {
        "min": 2.5,
        "max": 3.5,
        "text": "底线相持已经有一定稳定性，但深度和变化略显不足，可以通过刻意练习深球和落点变化来增加威胁，而不是只把球挂在中场。"
      },
      {
        "min": 3.5,
        "text": "底线相持是你的基础优势之一，可以在保证稳定的前提下加入更多节奏变化与主动进攻尝试，让对手更难适应你的节奏。"
      }
    ],
    "forehand": [
      {
        "max": 2.5,
        "text": "正手稳定性和动作基础偏弱，建议多做稳定中速对拉和基础挥拍练习，先把连续 6～8 拍打稳，再逐步考虑发力和旋转。"
      },
      {
        "min": 2.5,
        "max": 3.5,
        "text": "正手已具备一定稳定性和方向控制，可以在保证成功率的前提下，增加深度和上旋量，让正手逐渐从“安全球”变成“有威胁的球”。"
      },
      {
        "min": 3.5,
        "text": "正手已经是你的得分手段之一，可以更多通过节奏变化、线路选择和发力控制来提升效率，同时注意避免在并不舒服的来球上过度冒险。"
      }
    ],
    "backhand": [
      {
        "max": 2.5,
        "text": "反手是明显短板，面对来球时缺乏信心，建议优先把“稳挡回去”作为目标，练习基本站位和击球点，不必一开始就追求上旋或大力进攻。"
      },
      {
        "min": 2.5,
        "max": 3.5,
        "text": "反手在中速对拉中勉强可靠，可以增加切削和上旋的尝试，逐步从“防守反手”过渡到“可以发起进攻的反手”。"
      },
      {
        "min": 3.5,
        "text": "反手已不再是致命短板，在多数来回中都能支撑住，可以针对高球、快球和跑动中的反手做专项练习，提升在被压制状态下的质量。"
      }
    ],
    "serve": [
      {
        "max": 2.5,
        "text": "发球稳定性不足，会明显限制整体水平，建议系统练习抛球和标准二发动作，短期目标是把一局中的双误控制在 1 个以内。"
      },
      {
        "min": 2.5,
        "max": 3.5,
        "text": "发球已经能承担“开始一分”的任务，可以逐步区分一发和二发，在保证二发稳定的前提下提升一发威胁，增加落点与旋转变化。"
      },
      {
        "min": 3.5,
        "text": "发球具备一定攻击性，可以多练不同落点和旋转组合，让发球真正成为主导局面的武器，而不仅仅是开始一分的手段。"
      }
    ],
    "return": [
      {
        "max": 2.5,
        "text": "接发球时对速度变化较敏感，容易慌乱出错，建议从稳健挡回和调整站位开始练起，先把更多球稳定送回场内，逐步再考虑主动控制方向。"
      },
      {
        "min": 2.5,
        "max": 3.5,
        "text": "接发球对中速发球已经相对稳定，可以在对方二发时适当增加主动进攻，把“安全接发”升级成“有目的的接发”。"
      },
      {
        "min": 3.5,
        "text": "接发球具备一定攻击性，可以通过精细设计落点和节奏变化，在对方发球局中给出更多压力，为自己创造更多破发机会。"
      }
    ],
    "net": [
      {
        "max": 2.5,
        "text": "目前网前信心不足，上网更多是被动来到网前，建议从简单的正手截击和头顶高压开始练起，先建立“能稳稳打进”的感觉，再逐步追求进攻性。"
      },
      {
        "min": 2.5,
        "max": 3.5,
        "text": "网前能力处于过渡阶段，可以多做随球上网和“一拍终结”练习，重点提高判断上网时机和脚步到位速度。"
      },
      {
        "min": 3.5,
        "text": "网前已经具备一定威胁，可以针对低球截击、反手截击和连续截击做专项训练，让你在合适机会时更有把握通过一两拍结束这一分。"
      }
    ],
    "footwork": [
      {
        "max": 2.5,
        "text": "步伐和场地覆盖是当前短板，容易在被调动几拍后跑不到位，建议增加无球步伐练习和简单多球喂球，让身体先适应网球特有的移动节奏。"
      },
      {
        "min": 2.5,
        "max": 3.5,
        "text": "步伐基础尚可，可以多练习“左右调动 + 短球/高吊”组合，让你在多变球路下仍能打出稳定回球，而不至于被一两拍突然变化拉垮。"
      },
      {
        "min": 3.5,
        "text": "场地覆盖能力较好，可以通过体能和专项步伐训练，支撑更高强度的拉锯和更频繁的上网战术执行，让移动从“够用”变成“优势”。"
      }
    ],
    "tactics": [
      {
        "max": 2.5,
        "text": "目前更多是“把球打回去”，战术意识还比较模糊，可以从简单的规则开始，比如多打对手反手、多打深球，逐步建立“主动选择打哪里”的习惯。"
      },
      {
        "min": 2.5,
        "max": 3.5,
        "text": "已经有一定战术想法，会观察对手弱点，但执行容易受情绪和比分影响，建议在友谊赛中刻意练习“按计划打完整一局”的能力，训练决策稳定性。"
      },
      {
        "min": 3.5,
        "text": "战术意识较好，能根据对手特点调整打法，可以结合简单的比赛复盘，多思考“对某类选手什么策略成功率最高”，持续优化你的比赛模板。"
      }
    ],
    "match_result": [
      {
        "max": 3.0,
        "text": "目前与俱乐部中等偏上水平的对手对抗时，比分差距较大，说明整体技术和稳定性还有明显提升空间，可以多安排与稍强对手的友谊赛，熟悉比赛节奏。"
      },
      {
        "min": 3.0,
        "max": 3.8,
        "text": "你已经能和俱乐部高手打出一定拉锯，比分接近，说明整体水平接近稳定业余高手，再通过技术细节和心理稳定性训练，可以进一步缩小差距。"
      },
      {
        "min": 3.8,
        "text": "你对俱乐部高手的对抗成绩不错，说明自身水平在同圈层已经具备明显竞争力，可以多参加正式比赛或级别更高的对手检验自己。"
      }
    ],
    "training": [
      {
        "max": 3.0,
        "text": "近期打球频率不高或比较零散，短期内进步速度会受到限制，建议先建立一个最低频率的固定打球/训练节奏，例如每周至少一次基础对打。"
      },
      {
        "min": 3.0,
        "max": 4.0,
        "text": "你保持了比较稳定的打球频率，这是持续进步的好基础，可以逐步加入目标性更强的专项练习，比如专门练某一项技术或特定战术模式。"
      },
      {
        "min": 4.0,
        "text": "你的训练背景和频率较高，具备继续冲击更高水平的条件，可以结合比赛复盘来设计训练内容，让每一次训练更有针对性和目的性。"
      }
    ]
  }
}